# languages/tools
brew "gh"
brew "go"
brew "node"
brew "oven-sh/bun/bun"  # required by claude-mem
brew "python"
brew "uv"         # fast python package manager
brew "rust"
brew "powershell"
brew "lazygit"
brew "yq"


# shell
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "zoxide"
brew "fzf"
brew "nvim"

# modern cli replacements
brew "bat"        # better cat (syntax highlighting)
brew "eza"        # better ls (with icons, colors)
brew "fd"         # better find
brew "ripgrep"    # better grep
brew "delta"      # better git diff

# utilities
tap "gantoreno/macfetch"
brew "macfetch"   # neofetch-like system info for macOS
brew "stow"       # symlink manager (used by install script)
brew "tmux"       # terminal multiplexer
brew "ghq"        # git repository manager

# ai coding tools
brew "asheshgoplani/tap/agent-deck"  # Terminal session manager for AI coding agents.

# containers
brew "container"          # Apple's native Linux container runtime (macOS 15+, arm64)
brew "container-compose"  # docker-compose-like tool for Apple Container
